# OriginatingElementName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..OriginatingElementName Property
ParameterTypeId Class See Also
---
"Originating Element"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId OriginatingElementName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OriginatingElementName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ OriginatingElementName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace